def 判断(a):
    if a == 1:
        print(a)
    else:
        a+=a
        print(a)
a = 2
判断(a)


def 判断2(a):
    if a == 1:
        print(a)
    elif a == 2:
        print(a+3)
    else:
        a+=111
        print(a)
a = None
a = 3
判断2(a)


# def是啥？
# 先别管，后面会讲

# if判断，判断后面的东西以及成立之后的执行
# 这个看两眼就会了不说了哈

# 第一个判断：
# 传进来的是2，2不等于1，所以走else
# 2+2=4，打印4

# 第二个判断：
# 传进来的是3，3不等于1，也不等于2
# 所以走else，3+111=114，打印114

# if和elif的区别：
# if：第一个判断
# elif：如果上面的if没成立，再试试这个
# else：上面全都不成立，那就走这个


# 注意：如果有多个elif，从上到下走，只要有一个成立了，后面再成立也是看也不看
# 后面的看都不看
